Feature: [1-1]登录功能

#-----------------------------------------------------------------------------------------------------------------------
  @finish
  @login
  @login_success
  Scenario: [1-1-1]账号密码均正确，成功登录后台！
  	* 操作登陆功能自动化测试前数据准备
  
	* 访问“登录首页”页面：“http://m.mobvista.com/user/login”
	
	* 输入登录账号：“754414393@qq.com”
    
	* 输入登录密码：“llk123”

	* 按下登录Login按钮
	
	* 登录成功！
	
	* 操作登陆功能自动化测试后数据清理
#-----------------------------------------------------------------------------------------------------------------------
  @finish
  @login
  @login_failure
  Scenario: [1-1-2]账号错误，密码正确，登录失败！
  	* 操作登陆功能自动化测试前数据准备
  
	* 访问“登录首页”页面：“http://m.mobvista.com/user/login”
	
    * 输入登录账号：“error754414393@qq.com”
    
    * 输入登录密码：“llk123”

    * 按下登录Login按钮

    * 登录失败！系统提示：“Email or Password is wrong”
#-----------------------------------------------------------------------------------------------------------------------
  @finish
  @login
  @login_failure
  Scenario: [1-1-3]密码错误，账号正确，登录失败！
  	* 操作登陆功能自动化测试前数据准备
  
	* 访问“登录首页”页面：“http://m.mobvista.com/user/login”
	
	* 输入登录账号：“754414393@qq.com”
    
	* 输入登录密码：“123llk”

	* 按下登录Login按钮

	* 登录失败！系统提示：“Email or Password is wrong”
    
    
    
